{
  print "----------------------------------------------------------------------"
  print $0

  FIELDWIDTHS="2 5 2 2 3 4 2 13 11 9 9 2 4 1"
  getline
  print "0         1         2         3         4         5         6         "
  print "0123456789012345678901234567890123456789012345678901234567890123456789"
  print $0
  print "衛星カタログ番号                   : "$2
  print "軍事機密種別                       : "$3
  print "国際衛星識別符号"
  print "  打ち上げ年のラスト２桁           : "$4
  print "  その年の打ち上げの通算番号       : "$5
  print "  その打ち上げによる飛行体の通番   : "$6
  print "この軌道要素の元期(年のラスト２桁) : "$7
  print "元期(続き)                         : "$8
  print "平均運動の１次微分値を２で割った値 : "$9
  print "平均運動の２次微分値を２で割った値 : "$10
  print "B*(B STAR)抗力値                   : "$11
  print "軌道モデルの種別                   : "$12
  print "軌道要素通番                       : "$13
  print "チェックサム                       : "$14

  FIELDWIDTHS="2 6 9 9 8 9 9 11 5 1"
  getline
  print "0         1         2         3         4         5         6         "
  print "0123456789012345678901234567890123456789012345678901234567890123456789"
  print $0
  print "衛星カタログ番号                   : "$2
  print "軌道傾斜角(度)                     : "$3
  print "昇交点の赤経(度)                   : "$4
  print "離心率                             : "$5
  print "近地点引数(度)                     : "$6
  print "平均近点角(度)                     : "$7
  print "平均運動(回転/日)                  : "$8
  print "元期における通算周回数             : "$9
  print "チェックサム                       : "$10
}
